<?php


class Language{
    
    protected static $ru = array(
        
        'types' => array(
            'h1'       => 'Список типов',
            'fstitle'  => 'Быстрый поиск марок и моделей',
            'fsititle' => 'Быстрый поиск марок и моделей (Alt+Ч)',
        ),
        
        'marks' => array(
            'h1'      => 'Список марок',
            'offsite' => 'Официальный сайт',
        ),
        
        'models'     => array(
            'h1'  => 'Список моделей',
            'mod' => 'Модификации',
            'act' => 'Актуальность',
        ),
        
        'tree' => array(
            'h1'         => 'Дерево узлов',
            'open-close' => 'Раскрыть/Закрыть ветку',
        ),
        
        'map' => array(
            'h1'        => 'Карта размещения деталей',
            'hide-show' => 'Показать/Спрятать метки',
            'zoomdn'    => 'Уменьшить масштаб',
            'zoomdf'    => 'Масштаб 100%',
            'zoomup'    => 'Увеличить масштаб',
            'noimg'     => 'Нет иллюстрации',
            'N'         => '№',
            'detname'   => 'Наименование детали',
            'detnumber' => 'Номер детали',
            'more'      => 'Подробная информация',
            'imglook'   => 'Показать на рисунке',
        ),
        
        'search' => array(
            'h1title'  => 'Поиск по каталогу запчастей',
            'legend'   => 'Поиск',
            'h1result' => 'Результаты поиска по каталогу запчастей',
            'search'   => 'Вы искали',
            'result'   => 'Найдено',
            'nsearch'  => 'Новый поиск',
        ),
        
        'searchModels' => array(
            'h1' => 'Результаты быстрого поиска марок и моделей',
        ),
        
        'detailInfo' => array(
            'title' => 'Подробная информация',
            'h1'    => 'Подробная информация',
            'name'  => 'Автомобиль',
            'mod'   => 'Модификации',
            'act'   => 'Актуальность каталога',
            'dname' => 'Название детали',
            'dnum'  => 'Номер детали',
            'count' => 'Количество',
            'close' => 'закрыть',
        ),
        
    );
    
}
